cases/case_1p2_ke/0/TauDNS
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      TauDNS;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<symmTensor> 
10981
(
(4.58406e-06 -7.51376e-08 0 3.13016e-08 0 2.19978e-06)
(1.85891e-05 -4.95256e-07 0 2.39601e-07 0 7.17434e-06)
(3.01627e-05 -9.63895e-07 0 4.78111e-07 0 1.03761e-05)
(4.81397e-05 -1.92375e-06 0 9.87647e-07 0 1.40435e-05)
(5.95463e-05 -2.70529e-06 0 1.53052e-06 0 1.82588e-05)
(6.01741e-05 -2.95397e-06 0 1.91863e-06 0 2.13423e-05)
(5.58177e-05 -2.90422e-06 0 2.36263e-06 0 2.47262e-05)
(4.4582e-05 -2.35774e-06 0 3.23099e-06 0 2.98363e-05)
...
)
;

boundaryField
{
    bottomWall
    {
        type            zeroGradient;
    }
    defaultFaces
    {
        type            empty;
    }
    topWall
    {
        type            zeroGradient;
    }
    outlet
    {
        type            cyclic;
    }
    inlet
    {
        type            cyclic;
    }
}


// ************************************************************************* //
