cases/case_1p2_ke/0/UDNS
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      UDNS;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
10981
(
(0.000966181 -8.86407e-07 5.95425e-06)
(0.00335403 -1.19412e-05 1.5255e-05)
(0.00543891 -1.52944e-05 2.05351e-05)
(0.00962019 1.30991e-05 2.65318e-05)
(0.0145087 0.000105348 2.88737e-05)
(0.017801 0.00021666 2.68967e-05)
(0.0208006 0.000356443 2.07288e-05)
(0.0243807 0.000601964 1.85228e-06)
...
)
;

boundaryField
{
    bottomWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    defaultFaces
    {
        type            empty;
    }
    topWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            cyclic;
    }
    inlet
    {
        type            cyclic;
    }
}


// ************************************************************************* //
